In [15]:
import pandas as pd
import numpy as np

df_titanic = pd.read_csv('../dataset/train.csv')
# test=pd.read_csv('../dataset/test.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df_titanic.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [17]:
df_titanic['Age']=df_titanic['Age'].fillna(0)

In [18]:
sex = pd.get_dummies(df_titanic.Sex,prefix='Sex')
em = pd.get_dummies(df_titanic.Embarked,prefix="em")

frames=[df_titanic,sex,em]
df_titanic=pd.concat(frames,axis=1)

y=df_titanic.Survived.values
# y.reshape(-1,1)

X = df_titanic.drop(['PassengerId','Survived','Name','Ticket','Cabin','Sex','Embarked'],axis=1)
X.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_female  Sex_male  em_C  em_Q  em_S
0       3  22.0      1      0   7.2500           0         1     0     0     1
1       1  38.0      1      0  71.2833           1         0     1     0     0
2       3  26.0      0      0   7.9250           1         0     0     0     1
3       1  35.0      1      0  53.1000           1         0     0     0     1
4       3  35.0      0      0   8.0500           0         1     0     0     1

In [19]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)
print(X_train.shape,X_test.shape)

(712, 10) (179, 10)

In [20]:
from sklearn.preprocessing import StandardScaler
scalar=StandardScaler()
X_train=scalar.fit_transform(X_train)
X_test=scalar.transform(X_test)

In [21]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(X_train,y_train)

print('逻辑回归测试准确率:{:.2f}%'.format(lr.score(X_test,y_test)*100))

逻辑回归测试准确率:81.56%